# GetAllRevisionIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Revision..::..GetAllRevisionIds Method
Revision Class See Also
---
Returns the ids of all Revisions in the project ordered by sequence number.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static IList<ElementId> GetAllRevisionIds(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetAllRevisionIds ( _
	document As Document _
) As IList(Of ElementId)
```

Visual C++
---
```text
public:
static IList<ElementId^>^ GetAllRevisionIds(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document containing the Revisions.
# ### Return Value
The ids of all the Revisions in the document ordered by sequence number.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | document is not a project document. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Revision Class
Autodesk.Revit.DB Namespace